# Version:1.0 MMMC View Definition File
# Do Not Remove Above Line
create_rc_corner -name basic -cap_table {/CMC/kits/GPDK045/gpdk045_v_6_0/soce/gpdk045.basic.CapTbl} -T {125} -preRoute_res {1.0} -preRoute_cap {1.0} -preRoute_clkres {0.0} -preRoute_clkcap {0.0} -postRoute_res {1.0} -postRoute_cap {1.0} -postRoute_xcap {1.0} -postRoute_clkres {0.0} -postRoute_clkcap {0.0} -qx_tech_file {/CMC/kits/GPDK045/gsclib045_svt_v4.7/gsclib045/qrc/qx/gpdk045.tch}
create_op_cond -name slow -library_file {../Libraries/slow_vdd1v0_basicCells.lib} -P {1} -V {0.9} -T {125}
create_library_set -name Slow -timing {../Libraries/pads_SS_s1vg.lib ../Libraries/slow_vdd1v0_basicCells.lib}
create_constraint_mode -name Slow -sdc_files {../Synthesized/polynomial_top.sdc}
create_delay_corner -name Slow -library_set {Slow} -rc_corner {basic}
create_analysis_view -name Slow -constraint_mode {Slow} -delay_corner {Slow}
set_analysis_view -setup {Slow} -hold {Slow}
